#include<stdio.h>  

#incldue <stdlib.h>

int main(void)

{

    //输出一句话

    printf("hello hu~" );

    system("pause>0");

    return 0;

}

一、注意点

      1、空格随便加，看着大气，美观即可，每个单词的字母必须连续

      2、每条语句结束时加分号

      3、主函数名字，main 不要写成 mian，其他单词也别写错

      4、各种符号一定要是英文的，中文报错

      5、system("pause"); 卡住方便观察结果

           vs默认状态下需要这个，有的编译器不需要卡住

           其他卡住形式：getchar(); while(1);等等

           system是windows专用，其他系统可能就不好使了

      5、c/c++大括号的风格，都单独占一行

二、这段代码有5个要点

    1、注释  

       功能 对代码的功能进行标注，提高代码的可读性

       符号

          //code    单行注释

          /* code... */ 多行注释

       问题  多行注释嵌套时，结构会被破坏

       解决  个人注意  vs编译器自带快速注释按钮

    2、主函数

        作用：应用程序的入口，操作系统调用程序的接口，代码执行的起点

        形式：main   别写错，大家有写成mian会报错

        注意：一个项目只能有一个main函数

    常见的五种主函数的形式:

    (1)、C语言标准主函数形式

          int main(void)

          {

              return 0;

          }

    (2)、C/C++标准主函数形式，使用命令行参数

          int main(int argc, char* argv[])

          {

              return 0;

          }

    (3)、C++标准主函数形式

          int main()

          {

              return 0;

          }

    (4)、旧的C语言标准(1989年)的写法，现在的 C语言还支持这种写法,但是尽量不要这么写，请使用新标准(1)中的写法，C++不支持这种写法

          main()

          { 

          }

    (5)、非标准主函数写法，不提倡使用,C++之父说，这种形式的主函数在C语言和C++中都没有被定义

          void main()

          {  

          }

    建议大家使用标准形式的主函数，在哪儿都支持

    3、返回值

      形式：return 0;

      意义：0 表示正常结束

      注意：标准规定，程序员忘记写，编译器会帮我们加上。建议大家都写上，别懒。

    4、头文件

      #include<stdio.h>   标注输入输出头文件

      #include<stdlib.h>  标注库头文件

      作用：让我们可以使用C语言提供给我们的函数

      比如：printf 输出函数，在stdio.h中声明着，所以我们加上这个头文件才能用

            system 在stdlib.h中声明着，所以使用这个就要加对应头文件

    5、内建函数

      有时候使用一些函数，不加头文件也不会出错，能够正常执行。为什么？

          这种函数叫内建函数，本质就是常用函数，已在我们的编译器中定义好，我们直接用就行了

          目的是增加程序的编译效率

          不是所有的编译器都会这么做，建议大家一定要加上头文件，才能保证代码的移植性（通用性）

